source/.NET Standard/Unimake.Business.DFe/Servicos/Config/eSocial/AN.xml

<?xml version="1.0" encoding="utf-8" ?>
<Configuracoes>
	<Servicos ID="ESocial">
		<EnviarLoteEventosESocial versao="1.1.0">
			<Descricao>Enviar Lote Eventos eSocial</Descricao>
			<WebEnderecoProducao>https://webservices.envio.esocial.gov.br/servicos/empregador/enviarloteeventos/WsEnviarLoteEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/enviarloteeventos/WsEnviarLoteEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0/ServicoEnviarLoteEventos/EnviarLoteEventos</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0/ServicoEnviarLoteEventos/EnviarLoteEventos</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>EnviarLoteEventosResult</WebTagRetorno>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><EnviarLoteEventos xmlns="http://www.esocial.gov.br/servicos/empregador/lote/eventos/envio/v1_1_0"><loteEventos>{xmlBody}</loteEventos></EnviarLoteEventos></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/schema/lote/eventos/envio/v1_1_1</TargetNS>
		</EnviarLoteEventosESocial>
		<ConsultarEvtsEmpregador versao="1.1.0">
			<Descricao>Consultar Eventos pelo Empregador eSocial</Descricao>
			<WebEnderecoProducao>https://webservices.download.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0/ServicoConsultarIdentificadoresEventos/ConsultarIdentificadoresEventosEmpregador</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0/ServicoConsultarIdentificadoresEventos/ConsultarIdentificadoresEventosEmpregador</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<TagAssinatura>eSocial</TagAssinatura>
			<TagAtributoID>consultaIdentificadoresEvts</TagAtributoID>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarIdentificadoresEventosEmpregador xmlns="http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0"><consultaEventosEmpregador>{xmlBody}</consultaEventosEmpregador></ConsultarIdentificadoresEventosEmpregador></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/schema/consulta/identificadores-eventos/empregador/v1_0_0</TargetNS>
		</ConsultarEvtsEmpregador>
		<ConsultarEvtsTrabalhador versao="1.1.0">
			<Descricao>Consultar Eventos pelo Trabalhador eSocial</Descricao>
			<WebEnderecoProducao>https://webservices.download.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0/ServicoConsultarIdentificadoresEventos/ConsultarIdentificadoresEventosTrabalhador</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0/ServicoConsultarIdentificadoresEventos/ConsultarIdentificadoresEventosTrabalhador</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<TagAssinatura>eSocial</TagAssinatura>
			<TagAtributoID>consultaIdentificadoresEvts</TagAtributoID>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarIdentificadoresEventosTrabalhador xmlns="http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0"><consultaEventosTrabalhador>{xmlBody}</consultaEventosTrabalhador></ConsultarIdentificadoresEventosTrabalhador></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/schema/consulta/identificadores-eventos/trabalhador/v1_0_0</TargetNS>
		</ConsultarEvtsTrabalhador>
		<ConsultarEvtsTabela versao="1.1.0">
			<Descricao>Consultar Eventos da Tabela eSocial</Descricao>
			<WebEnderecoProducao>https://webservices.download.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0/ServicoConsultarIdentificadoresEventos/ConsultarIdentificadoresEventosTabela</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0/ServicoConsultarIdentificadoresEventos/ConsultarIdentificadoresEventosTabela</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<TagAssinatura>eSocial</TagAssinatura>
			<TagAtributoID>consultaIdentificadoresEvts</TagAtributoID>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ConsultarIdentificadoresEventosTabela xmlns="http://www.esocial.gov.br/servicos/empregador/consulta/identificadores-eventos/v1_0_0"><consultaEventosTabela>{xmlBody}</consultaEventosTabela></ConsultarIdentificadoresEventosTabela></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/schema/consulta/identificadores-eventos/tabela/v1_0_0</TargetNS>
		</ConsultarEvtsTabela>
		<DownloadPorNrRec versao="1.1.0">
			<Descricao>Download Eventos por Número do Recibo</Descricao>
			<WebEnderecoProducao>https://webservices.download.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0/ServicoSolicitarDownloadEventos/SolicitarDownloadEventosPorNrRecibo</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0/ServicoSolicitarDownloadEventos/SolicitarDownloadEventosPorNrReciboResponse</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<TagAssinatura>eSocial</TagAssinatura>
			<TagAtributoID>download</TagAtributoID>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SolicitarDownloadEventosPorNrRecibo xmlns="http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0"><solicitacao>{xmlBody}</solicitacao></SolicitarDownloadEventosPorNrRecibo></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0</TargetNS>
		</DownloadPorNrRec>
		<DownloadPorID versao="1.1.0">
			<Descricao>Download Eventos por ID</Descricao>
			<WebEnderecoProducao>https://webservices.download.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoProducao>
			<WebEnderecoHomologacao>https://webservices.producaorestrita.esocial.gov.br/servicos/empregador/dwlcirurgico/WsConsultarIdentificadoresEventos.svc?wsdl</WebEnderecoHomologacao>
			<WebActionProducao>http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0/ServicoSolicitarDownloadEventos/SolicitarDownloadEventosPorId</WebActionProducao>
			<WebActionHomologacao>http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0/ServicoSolicitarDownloadEventos/SolicitarDownloadEventosPorId</WebActionHomologacao>
			<WebContentType>text/xml</WebContentType>
			<WebTagRetorno>s:Body</WebTagRetorno>
			<TagAssinatura>eSocial</TagAssinatura>
			<TagAtributoID>download</TagAtributoID>
			<WebSoapString><![CDATA[<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><SolicitarDownloadEventosPorId xmlns="http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0"><solicitacao>{xmlBody}</solicitacao></SolicitarDownloadEventosPorId></soap:Body></soap:Envelope>]]></WebSoapString>
			<TargetNS>http://www.esocial.gov.br/servicos/empregador/download/solicitacao/v1_0_0</TargetNS>
		</DownloadPorID>
	</Servicos>
</Configuracoes>
